#ระบบแม่สูตรคูณอัตรโนมัติ
o = 1
while True:
    print('โปรแกรมแม่สูตรคูณสั่งได้')
    i = int(input("ใส่นวนหลักที่ต้องการ{ถ้าท่านไม่ต้องการหาต่อพิมพ์ 0}: "))
    if i == 0:
        print('---ขอบคุณที่ใช้บริการ---')
        break
    e = int(input("ใส่จำนวนที่ต้องการคูณ: "))
    total = i * e
    print(f"---จำนวนที่ท่านต้องการรู้คือ {i}x{e}={total}---")
    w = input('ท่านต้องการแม่สูตรคูณแบบเรียงลงมารึปล่าว?\nถ้าต้องการกดเลข [1] \nแต่ถ้าไม่ต้องการกดเลข [2]')
    while True:
        if w == '1':
            while o <= e:
                total_w = i * o 
                print(f'{i}x{o}={total_w}')
                o = o + 1
                if o <= e:
                    break
        elif w == '2':
            print('ok')
            break
        else:
            print('***กวนตีนอ่อ ไม่อ่านวะโหลลล!!!***')