print('บัตรเติมเงินของคุณ')
ยอดเงินในบัตร = int(input('กรุณาใส่ยอดเงิน: '))
ราคาสินค้า = int(input('กรุณาใส่ราคาสินค้า: '))

if ยอดเงินในบัตร >= ราคาสินค้า:
   ยอดเงินคงเหลือ = ยอดเงินในบัตร - ราคาสินค้า
   print('ยอดเงินคงเหลือของท่านคือ: ' , ยอดเงินคงเหลือ, 'THB' )
   print('---ชำระเงินสำเร็จ---')
if ยอดเงินคงเหลือ <= 20:
    print('คำเตือน!!!ยอดเงินของท่านใกล้จะหมดกรุณาเติมเงิน' , ยอดเงินคงเหลือ, 'THB')
    print('---ชำระเงินสำเร็จ---')
else:
    ยอดเงินในบัตร < ราคาสินค้า
    เงินที่ขาด = ราคาสินค้า - ยอดเงินในบัตร
    print('จำนวนเงินในระบบของท่านไม่เพียงพอ' , เงินที่ขาด, 'THB')
print('---ขอบคุณที่ใช้บริการครับ---')