print('ยินต้อนรับเข้าสู่ปั๊มเขียว')
print('ตอนนี้ปั๊มเขียวของเรามี Promotion สำหรับคนเติมเยอะ')
รับเงิน = int(input('กรุณาใส่จำนวนเงิน: '))
จำนวนลิตร = int(input('กรุณาใส่จำนวนน้ำมันที่ท่านต้องการเติม: '))
ราคารวม = จำนวนลิตร * 30
if จำนวนลิตร >= 50:
    ราคารวม = ราคารวม - 100
    print('คุณได้รับส่วนลด 100 บาท')

if รับเงิน >= ราคารวม:
    เงินทอน = รับเงิน - ราคารวม
    print('เงินทอนของคุณคือ: ', เงินทอน)
else:
    เงินขาด = ราคารวม - รับเงิน
    print('เงินไม่พอขาดอีก: ', เงินขาด)